{
    "robot_token": "cold-man",
    "robot_number": "KGN-002",
    "robot_name": "Cold Man",
    "robot_game": "RnF",
    "robot_field": "",
    "robot_field2": "",
    "robot_support": "",
    "robot_class": "master",
    "robot_gender": "male",
    "robot_image": "cold-man",
    "robot_image_size": 40,
    "robot_image_editor": "milansaponja",
    "robot_image_editor2": "",
    "robot_image_alts": [
        {
            "token": "alt",
            "name": "Cold Man (Cola Alt)",
            "summons": 100,
            "colour": "swift"
        },
        {
            "token": "alt2",
            "name": "Cold Man (Grape Alt)",
            "summons": 200,
            "colour": "time"
        },
        {
            "token": "alt3",
            "name": "Cold Man (Weapon Alt)",
            "summons": 300,
            "colour": "freeze"
        },
        {
            "token": "alt4",
            "name": "Cold Man (Weapon Alt 2)",
            "summons": 400,
            "colour": "shield"
        },
        {
            "token": "alt9",
            "name": "Cold Man (Darkness Alt)",
            "summons": 900,
            "colour": "empty"
        }
    ],
    "robot_core": "freeze",
    "robot_core2": "",
    "robot_description": "Deep Freeze Robot",
    "robot_description2": "Some of Dr. Wily’s schemes are so maniacal that they just sound goofy. Threatening to make robotic dinosaur hybrids might sound scary to an elementary school student, but not to the world populace who has seen your world domination schemes fail countless times. Wily seemed to have realized this as well, and the project only got as far as stealing a refrigerator holding dinosaur DNA from Light Labs. The fridge collected dust in storage until being rediscovered by King, who saw value in any electronic device, even one without consciousness. So, after tossing aside the vials of dinosaur DNA worth billions, King set about turning the discount fridge into a combat robot master. The first modification was cranking Cold Man’s temperature from a toasty negative eighty degrees Celsius to near absolute zero. Cold Man uses this chilling cold to freeze the very air around him, generating the Ice Wall, a tumbling column of ice that can be launched at his foes. This had the unfortunate side effect of slowing down all of Cold Man’s functions, as the closer it is to absolute zero, the less particles move. To accommodate this, King deliberately designed a boring personality for Cold Man. It meant Cold Man was uninvested in his new life, but it was better to be consistent in mundanity than inconsistent in delicate tasks. It’s important to note that Cold Man isn’t dumb; far from it, Cold Man is quite efficient at what he does, he just doesn’t care about doing it; apathy is separate from intelligence. There is no passion to his fight, but Cold Man can still be a dangerous opponent! The only thing that can really motivate Cold Man are sweets, which is a bit odd considering he has no mouth and also is a robot. That doesn’t stop Cold Man from picking up a Frappuccino on his way into work every day and some shaved ice on his way back home. Maybe he just likes storing them inside of him, nostalgic for his days as a refrigerator?",
    "robot_energy": 108,
    "robot_weapons": 10,
    "robot_attack": 92,
    "robot_defense": 124,
    "robot_speed": 76,
    "robot_weaknesses": [
        "electric",
        "impact"
    ],
    "robot_resistances": [
        "water"
    ],
    "robot_affinities": [
        "freeze"
    ],
    "robot_immunities": [],
    "robot_skill": "",
    "robot_skill_name": "",
    "robot_skill_description": "",
    "robot_skill_description2": "",
    "robot_skill_parameters": [],
    "robot_abilities_rewards": [
        {
            "level": 0,
            "token": "ice-wall"
        }
    ],
    "robot_abilities_compatible": [
        "ice-wall"
    ],
    "robot_quotes_start": "You'll have to compensate for overtime on this one, {this_player}.",
    "robot_quotes_taunt": "*Yawn* This is more boring than my job...",
    "robot_quotes_victory": "Now I have something to talk about at work, at least.",
    "robot_quotes_defeat": "Does this mean I can take the rest of the day off?",
    "robot_quotes_custom": [],
    "robot_flag_hidden": 0,
    "robot_flag_complete": 1,
    "robot_flag_unlockable": 0,
    "robot_flag_fightable": 1,
    "robot_flag_exclusive": 0,
    "robot_flag_published": 1
}
