{
    "robot_token": "clown-man",
    "robot_number": "DWN-060",
    "robot_name": "Clown Man",
    "robot_game": "MM8",
    "robot_field": "",
    "robot_field2": "",
    "robot_support": "",
    "robot_class": "master",
    "robot_gender": "male",
    "robot_image": "clown-man",
    "robot_image_size": 80,
    "robot_image_editor": "milansaponja",
    "robot_image_editor2": "rockmanfc",
    "robot_image_alts": [
        {
            "token": "alt",
            "name": "Clown Man (Bozo Alt)",
            "summons": 100,
            "colour": "flame"
        },
        {
            "token": "alt2",
            "name": "Clown Man (Sewer Alt)",
            "summons": 200,
            "colour": "nature"
        },
        {
            "token": "alt3",
            "name": "Clown Man (Weapon Alt)",
            "summons": 300,
            "colour": "swift"
        },
        {
            "token": "alt9",
            "name": "Clown Man (Darkness Alt)",
            "summons": 900,
            "colour": "empty"
        }
    ],
    "robot_core": "electric",
    "robot_core2": "",
    "robot_description": "Electrifying Entertainer Robot",
    "robot_description2": "You’ve got to feel bad for the Mega City Horror Land amusement park. Haunted Houses are already a niche workspace, so any financial hardships they encounter hit pretty hard. That means it was bad enough when their vampire animatronic was stolen by the infamous Dr. Wily and turned into a combat robot, but for their replacement clown animatronic to suffer the same fate? It seems like Wily might have done it just out of spite anyways, because unlike Shade Man who was just given some combat abilities, Clown Man was originally going to require much more serious enhancements. Clown Man was supposed to be much bigger, possibly acting as an upgraded version of Mash, but Wily ultimately decided to use the hulking robot design for Frost Man instead. This was definitely the right call, as Clown Man’s telescoping arms and light frame allow him to fly across the battlefield, pulling stunts that would make trapeze artists blush! Clown Man has an easy time latching to and swinging around metal objects thanks to the Thunder Claw, an extension of his arms that violently discharge electricity. He’s not afraid to throw his weight around either, bringing a whole new meaning to assault and battery! Don’t expect to hear too many jokes like that from Clown Man himself, however. The manic Robot Master is seldom taken seriously in his more routine activities, so he strives to be respected in combat. He’ll even hurdle insults at you during the fight, and being called “geeky” has never felt so demoralizing as it does when it comes from a clown. This desire for respect rarely seems to work on the battlefield, however, as even the slightest breeze can cause Clown Man to get tangled up like earphones in a pocket. Still, his electric attacks can devastate unassuming opponents, so try to knock him out as quickly as possible! Well, maybe don’t knock him out cold; Clown Man’s a sleep talker, and you don’t want to hear how you’re faring in his dreams.",
    "robot_energy": 97,
    "robot_weapons": 10,
    "robot_attack": 104,
    "robot_defense": 68,
    "robot_speed": 131,
    "robot_weaknesses": [
        "wind",
        "cutter"
    ],
    "robot_resistances": [
        "electric",
        "shadow"
    ],
    "robot_affinities": [],
    "robot_immunities": [],
    "robot_skill": "",
    "robot_skill_name": "",
    "robot_skill_description": "",
    "robot_skill_description2": "",
    "robot_skill_parameters": [],
    "robot_abilities_rewards": [
        {
            "level": 0,
            "token": "thunder-claw"
        }
    ],
    "robot_abilities_compatible": [
        "thunder-claw"
    ],
    "robot_quotes_start": "Don’t expect any funny business!... Come on, I'm being serious!",
    "robot_quotes_taunt": "Hehe, you're gonna lose anyway! Gaze upon my thunder carnival act!",
    "robot_quotes_victory": "Yo geeky, your performance was hilarious! Hilariously BAD!",
    "robot_quotes_defeat": "Ouch! See you in my dreams!",
    "robot_quotes_custom": [],
    "robot_flag_hidden": 0,
    "robot_flag_complete": 1,
    "robot_flag_unlockable": 0,
    "robot_flag_fightable": 1,
    "robot_flag_exclusive": 0,
    "robot_flag_published": 1
}
