{
    "robot_token": "ground-man",
    "robot_number": "KGN-003",
    "robot_name": "Ground Man",
    "robot_game": "RnF",
    "robot_field": "",
    "robot_field2": "",
    "robot_support": "",
    "robot_class": "master",
    "robot_gender": "male",
    "robot_image": "ground-man",
    "robot_image_size": 80,
    "robot_image_editor": "milansaponja",
    "robot_image_editor2": "rockmanfc",
    "robot_image_editor3": "",
    "robot_image_alts": [
        {
            "token": "alt",
            "name": "Ground Man (Demolition Alt)",
            "summons": 100,
            "colour": "explode"
        },
        {
            "token": "alt2",
            "name": "Ground Man (Buildron Alt)",
            "summons": 200,
            "colour": "energy"
        },
        {
            "token": "alt3",
            "name": "Ground Man (Weapon Alt)",
            "summons": 300,
            "colour": "swift"
        },
        {
            "token": "alt4",
            "name": "Ground Man (Weapon Alt 2)",
            "summons": 400,
            "colour": "laser"
        },
        {
            "token": "alt9",
            "name": "Ground Man (Darkness Alt)",
            "summons": 900,
            "colour": "empty"
        }
    ],
    "robot_core": "earth",
    "robot_core2": "",
    "robot_description": "Underground Drilling Robot",
    "robot_description2": "Many robots willingly joined King’s militia, but King knew he would need a right-hand man of his own design if he wanted his grand machinations to succeed. After all, it’s hard to make a reliable chain of command when a requirement for the robots you're recruiting is the willingness to shirk their responsibilities. No, King would need a reliable ally to give the most important task of the revolution: to collect a ludicrous amount of wealth. Afterall, what is a king with no treasure hoard? Thus, Ground Man was created and immediately sent off to raid ruins for their riches. Ground Man’s quick work of these ruins is actually what tipped off much of the world to King’s militia forming, as nobody recognized the rogue Robot Master who was plundering these relics. And plunder he did, largely thanks to the Spread Drill, a versatile mining tool that doubled as a weapon in his climactic fight with Mega Man and Bass. The device can remotely split apart into smaller drills, allowing it to cover a greater surface area. However, it would be misleading to suggest this is all Ground Man can do. He can transform into a vehicle sporting a gigantic drill blade, cruising through rock as if it was sand! Not actual sand though, as that would have quite the opposite effect. Ground Man is always moaning about how bogged down he gets in the stuff, it filling up all his servos. Ground Man is a bit of stick in the mud in general, always focused on the task at hand. He’ll be more than willing to discuss the job and how best to do it, he’s just unwilling to talk about anything else. Anything besides his own collection of valuables, that is. Ground Man started skimming the plundered loot he was collecting, taking small enough portions that he assumed no one would notice. King did notice, but he simply didn’t care, as it just meant Ground Man worked even harder to find more treasure to replace the trinkets he kept!",
    "robot_energy": 103,
    "robot_weapons": 10,
    "robot_attack": 80,
    "robot_defense": 106,
    "robot_speed": 111,
    "robot_weaknesses": [
        "explode",
        "crystal"
    ],
    "robot_resistances": [
        "earth",
        "swift"
    ],
    "robot_affinities": [],
    "robot_immunities": [],
    "robot_skill": "find-item-at-end-of-turn",
    "robot_skill_name": "Item Excavator",
    "robot_skill_description": "Allows the robot to find consumable items during battle",
    "robot_skill_description2": "The robot intermittently excavates the ground below its feet looking for consumable items like pellets, capsules, and tanks.",
    "robot_skill_parameters": {
        "all": false,
        "screws": true,
        "pellets": true,
        "capsules": true,
        "tanks": true
    },
    "robot_abilities_rewards": [
        {
            "level": 0,
            "token": "spread-drill"
        }
    ],
    "robot_abilities_compatible": [
        "spread-drill"
    ],
    "robot_quotes_start": "....Hmm. Is there a problem, {target_robot}...?",
    "robot_quotes_taunt": ".... Hmph!",
    "robot_quotes_victory": "I yearn only for my riches. To this end, I won't be stopped.",
    "robot_quotes_defeat": "Ugh. I hate sand.",
    "robot_quotes_custom": [],
    "robot_flag_hidden": 0,
    "robot_flag_complete": 1,
    "robot_flag_unlockable": 0,
    "robot_flag_fightable": 1,
    "robot_flag_exclusive": 0,
    "robot_flag_published": 1
}
