{
    "robot_token": "buster-rod-g",
    "robot_number": "WWN-001",
    "robot_name": "Buster Rod G",
    "robot_game": "MMWW",
    "robot_field": "genesis-tower",
    "robot_field2": "",
    "robot_support": "",
    "robot_class": "boss",
    "robot_gender": "none",
    "robot_image": "buster-rod-g",
    "robot_image_size": 40,
    "robot_image_editor": "milansaponja",
    "robot_image_editor2": "",
    "robot_image_alts": [],
    "robot_core": "swift",
    "robot_core2": "",
    "robot_description": "Agile Monkey Unit",
    "robot_description2": "After a few failed attempts at conquering the world, Wily constructed the magnificent Wily Tower, and he put the Genesis Unit as his main line of defense. Buster Rod G was designed to naturally lead the group, being the swiftest and most skilled of the bunch. However, due to his general inexperience as serving as a combat robot, Buster Rod G ended up failing against Mega Man, and the Wily Tower scheme ended just like every other Wily plan. His main weapon is his extendable rod, which can grow to great lengths to attack the opponent. After losing to Mega Man, Buster Rod G's been reported to have survived and traveled on a journey to a foreign land in the west, training for the day that he can face Mega Man in battle yet again. He's a rowdy robot, and argues with Mega Water S constantly. He's a bit of a bubble brain, and can easily be convinced to things if you offer some banana bribery. He also dislikes Rush, Mega Man's trusty helper. While Buster Rod G is one of Mega Man's lesser known rivals, he's as unique as they come, just not nearly as serious or as conventional as the rest of them.",
    "robot_energy": 115,
    "robot_weapons": 20,
    "robot_attack": 155,
    "robot_defense": 145,
    "robot_speed": 185,
    "robot_weaknesses": [
        "water",
        "freeze"
    ],
    "robot_resistances": [
        "nature"
    ],
    "robot_affinities": [],
    "robot_immunities": [],
    "robot_skill": "tenacity-submodule",
    "robot_skill_name": "Monkey Sutra",
    "robot_skill_description": "The robot can inflict Swift type damage without resistance",
    "robot_skill_description2": "The robot use ancient techniques to bypass resistances and negative multipliers when dealing Swift-type damage.",
    "robot_skill_parameters": {
        "type": "swift"
    },
    "robot_abilities_rewards": [
        {
            "level": 0,
            "token": "buster-rod"
        }
    ],
    "robot_abilities_compatible": [
        "buster-rod",
        "barrier-drive",
        "shield-eater"
    ],
    "robot_quotes_start": "My blood's pumping... {target_robot}, I can tell this'll be a good fight!",
    "robot_quotes_taunt": "The road to enlightenment requires a strong soul.. and many, many bananas.",
    "robot_quotes_victory": "Hey, let's train together sometime, you and me, take a journey somewhere!",
    "robot_quotes_defeat": "Oo-ahh, {target_robot}! I'm already itchin' to fight again!",
    "robot_quotes_custom": [],
    "robot_flag_hidden": 0,
    "robot_flag_complete": 1,
    "robot_flag_unlockable": 0,
    "robot_flag_fightable": 1,
    "robot_flag_exclusive": 0,
    "robot_flag_published": 1
}
