{
    "robot_token": "search-man",
    "robot_number": "DWN-061",
    "robot_name": "Search Man",
    "robot_game": "MM8",
    "robot_field": "",
    "robot_field2": "",
    "robot_support": "",
    "robot_class": "master",
    "robot_gender": "male",
    "robot_image": "search-man",
    "robot_image_size": 80,
    "robot_image_editor": "milansaponja",
    "robot_image_editor2": "rockmanfc",
    "robot_image_alts": [],
    "robot_core": "missile",
    "robot_core2": "",
    "robot_description": "Jungle Commando Robot",
    "robot_description2": "Even in the technological golden era of 20XX, where robotics sensory and decision making algorithms have advanced far beyond the abilities of humans, one particular adage holds true; two heads are better than one. Wily thought giving two distinct personalities would enhance a combat robot’s performance, as their different thought processes and doubled processing speeds would allow them to make the most effective decisions. It’s too bad Wily forgot to actually program a second personality, essentially leaving Search Man a ventriloquist dressed in camo. Perhaps Wily can be forgiven for his absentmindedness, as he was busy experimenting with the extraterrestrial Evil Energy, which Search Man guarded access to by hiding out in the Congo. Here he defended his outpost with all the artillery of a one man army. Er, maybe a two man army… or would it be a one man and a half army? Either way, Search Man was a tricky opponent for Mega Man, taking potshots at the Blue Bomber with his Homing Sniper, a relentless seeking missile. Search Man has also historically used spiked discs and booby traps on the battlefield, but his most renowned tactic might be his propensity for hiding, which other war robots chastise him for. Maybe if they tried it themselves, they’d see why Search Man manages to maintain such a jovial attitude, because all that time hiding out gives Search Man the opportunity to appreciate the simpler things in life. Unlike other war robots, Search Man gets to stop to smell the roses, staying optimistic in even the harshest battles. He can see the beauty in the world, and is fighting to preserve what he believes is right. Besides, he’d rather be talking to squirrels than his enemies.",
    "robot_energy": 92,
    "robot_weapons": 10,
    "robot_attack": 120,
    "robot_defense": 92,
    "robot_speed": 96,
    "robot_weaknesses": [
        "flame",
        "explode"
    ],
    "robot_resistances": [
        "nature",
        "earth"
    ],
    "robot_affinities": [],
    "robot_immunities": [],
    "robot_skill": "",
    "robot_skill_name": "",
    "robot_skill_description": "",
    "robot_skill_description2": "",
    "robot_skill_parameters": [],
    "robot_abilities_rewards": [
        {
            "level": 0,
            "token": "homing-sniper"
        }
    ],
    "robot_abilities_compatible": [
        "homing-sniper"
    ],
    "robot_quotes_start": "Target, get set! Begin mission.",
    "robot_quotes_taunt": "Take this! My surprise attack! ...Don't announce it, idiot!",
    "robot_quotes_victory": "Wait, I really won? Yes, sir!",
    "robot_quotes_defeat": "Retreat! Retreat!",
    "robot_quotes_custom": [],
    "robot_flag_hidden": 0,
    "robot_flag_complete": 1,
    "robot_flag_unlockable": 0,
    "robot_flag_fightable": 1,
    "robot_flag_exclusive": 0,
    "robot_flag_published": 1
}
