{
    "robot_token": "frost-man",
    "robot_number": "DWN-062",
    "robot_name": "Frost Man",
    "robot_game": "MM8",
    "robot_field": "",
    "robot_field2": "arctic-jungle",
    "robot_support": "peng",
    "robot_class": "master",
    "robot_gender": "male",
    "robot_image": "frost-man",
    "robot_image_size": 80,
    "robot_image_editor": "brashbuster",
    "robot_image_editor2": "rockmanfc",
    "robot_image_alts": [
        {
            "token": "alt",
            "name": "Frost Man (Berry Alt)",
            "summons": 100,
            "colour": "crystal"
        },
        {
            "token": "alt2",
            "name": "Frost Man (Citrus Alt)",
            "summons": 200,
            "colour": "energy"
        },
        {
            "token": "alt3",
            "name": "Frost Man (Weapon Alt)",
            "summons": 300,
            "colour": "weapons"
        },
        {
            "token": "alt9",
            "name": "Frost Man (Darkness Alt)",
            "summons": 900,
            "colour": "empty"
        }
    ],
    "robot_core": "freeze",
    "robot_core2": "",
    "robot_description": "Frozen Brute Robot",
    "robot_description2": "Freeze core robots have generally been designed to be acrobatic, darting around gracefully on icy surfaces. Blizzard Man was somewhat of an exception, with a more annular design, but he was ultimately still a robot made to zoom across the tundra. Dr. Wily decided to amend this by repurposing his scrapped hefty Clown Man chassis into the monstrous Frost Man. This behemoth of a robot is taller than even Stone Man and second only in weight to Hard Man, so his bruiser attitude should come as no surprise. Size isn’t the only thing up Frost Man’s sleeve though. Wily rapidly prototyped more and more advanced cryogenic generators, equipping Frost Man with his final iteration, possibly making Frost Man the coldest of the cold Robot Masters up to that point. Don’t think you’re gonna chip away at his rimy exterior, as Frost Man’s dense armor reflects any attacks that can’t melt through. He’s not afraid to use his chilling might in combat either, capable of unleashing the deceptively quick Ice Wave on his foes. That is, if the punches and body checks don’t work. It’s a good thing Frost Man can send that Ice Wave as fast as he does, as the robot is otherwise pretty slow. The dense armor doesn’t leave a lot of room for Frost Man’s oil circulatory system, and the low temperature hinders this even more. Frost Man’s IC chip is also affected by this, meaning Frost Man’s mental prowess matches his complete lack of agility. The giant, while placatable, is anything but gentle, enjoying crushing everything smaller than him… so basically everything. He crushes buildings and robots like a kid tearing through toy blocks, and is similarly able to be distracted by popsicles and kakigori. This outright oafish nature of Frost Man makes his immaculate ice sculpting skills all the more surprising. Maybe that slow mobility gives Frost Man a steadier hand for the precise craft? Or maybe he’s just too stupid to realize it’s boring and he’d rather be doing something else.",
    "robot_energy": 110,
    "robot_weapons": 10,
    "robot_attack": 113,
    "robot_defense": 109,
    "robot_speed": 68,
    "robot_weaknesses": [
        "explode",
        "flame"
    ],
    "robot_resistances": [
        "water"
    ],
    "robot_affinities": [],
    "robot_immunities": [
        "missile"
    ],
    "robot_skill": "",
    "robot_skill_name": "",
    "robot_skill_description": "",
    "robot_skill_description2": "",
    "robot_skill_parameters": [],
    "robot_abilities_rewards": [
        {
            "level": 0,
            "token": "frost-wave"
        }
    ],
    "robot_abilities_compatible": [
        "frost-wave"
    ],
    "robot_quotes_start": "I'M GOING TO CRUSH YOU!",
    "robot_quotes_taunt": "JUMP, JUMP! SLIDE, SLIDE! CRUSH, FREEZE!",
    "robot_quotes_victory": "YUM, YUM, YUM! HAPPY POPSICLES!",
    "robot_quotes_defeat": "THAT HURT! OWWIE!",
    "robot_quotes_custom": [],
    "robot_flag_hidden": 0,
    "robot_flag_complete": 1,
    "robot_flag_unlockable": 1,
    "robot_flag_fightable": 1,
    "robot_flag_exclusive": 0,
    "robot_flag_published": 1
}
