{
    "robot_token": "blade-man",
    "robot_number": "DWN-073",
    "robot_name": "Blade Man",
    "robot_game": "MM10",
    "robot_field": "industrial-facility",
    "robot_field2": "",
    "robot_support": "",
    "robot_class": "master",
    "robot_gender": "male",
    "robot_image": "blade-man",
    "robot_image_size": 80,
    "robot_image_editor": "milansaponja",
    "robot_image_editor2": "",
    "robot_image_editor3": "",
    "robot_image_alts": [
        {
            "token": "alt",
            "name": "Blade Man (Tempered Alt)",
            "summons": 100,
            "colour": "flame"
        },
        {
            "token": "alt2",
            "name": "Blade Man (Kusanagi Alt)",
            "summons": 200,
            "colour": "nature"
        },
        {
            "token": "alt3",
            "name": "Blade Man (Weapon Alt)",
            "summons": 300,
            "colour": "wily"
        },
        {
            "token": "alt4",
            "name": "Blade Man (DOS Alt)",
            "summons": 400,
            "colour": "crystal"
        },
        {
            "token": "alt5",
            "name": "Blade Man (One True Blade Alt)",
            "summons": 500,
            "colour": "missile"
        },
        {
            "token": "alt9",
            "name": "Blade Man (Darkness Alt)",
            "summons": 900,
            "colour": "empty"
        }
    ],
    "robot_core": "cutter",
    "robot_core2": "",
    "robot_description": "Sword Sparring Robot",
    "robot_description2": "For many years, Blade Man served dutifully as the cutting-edge guide and guardian at a historic castle site. The current lord of the castle, by all accounts a reported fanatic of all things swordsmanship-related, had Blade Man built in order to elegantly fuse the practices of the past with the many refinements afforded by the future. This luxurious background gave Blade Man the opportunity to truly fall in love with the sharp art of armaments, delivering him his purpose and drive in life. Unfortunately, during the Roboenza epidemic, Blade Man became one of the earliest documented cases, and in his sickened frenzy overtook and ravaged the castle he was meant to safeguard. Despite not necessarily being designed for combat, as a robot whose hands could carve a turkey in two, it wasn’t particularly hard for him to adapt; Blade Man used his acute appendages to rapidly cover ground all over the castle. Of course, he was also quite knowledgeable in sword-fighting and in performance impalement arts, which was terrifying when paired with his signature Triple Blade ability, a volley of piercing miniature blades. Blade Man was eventually quelled, cured, and allowed to return to work, though not without a lot of legal contention from the World Robot Union, who contested the safety of Blade Man’s design in a workplace setting. He was only somewhat dubiously cleared after the castle lord argued that Blade Man’s mania was technically historically significant to the castle, and he needed to be maintained as an important figure to the site. This was a joy for Blade Man anyway, as he could return to lecturing tourists and sightseers once again to his heart’s content; Blade Man’s known to be a bit of a nerd when it comes to swords, and his passionate ramblings have confused and lost many jetlagged travelers. Just don’t get him started when it comes to new-era technology weapons like the busters – he’ll tell you all about how a proper gentleman would never use those! When it comes time to fight, don’t think he’s dumb in bringing a sword to a gunfight; otherwise, you’ll be the one picking up the pieces!",
    "robot_energy": 102,
    "robot_weapons": 10,
    "robot_attack": 127,
    "robot_defense": 64,
    "robot_speed": 107,
    "robot_weaknesses": [
        "missile",
        "earth"
    ],
    "robot_resistances": [
        "wind"
    ],
    "robot_affinities": [
        "cutter"
    ],
    "robot_immunities": [],
    "robot_skill": "stat-boost-at-end-of-turn",
    "robot_skill_name": "For Honor",
    "robot_skill_description": "Drastically boosts the robot's defense when in danger",
    "robot_skill_description2": "The robot's defense stat is boosted by three stages when they're pushed to the brink in battle.",
    "robot_skill_parameters": {
        "stat": "defense",
        "amount": 3,
        "condition": "energy <= 40%",
        "repeat": false
    },
    "robot_abilities_rewards": [
        {
            "level": 0,
            "token": "triple-blade"
        }
    ],
    "robot_abilities_compatible": [
        "triple-blade"
    ],
    "robot_quotes_start": "I hereby challenge you to a duel! En garde, {target_robot}!",
    "robot_quotes_taunt": "Parry! Thrust! Riposte!",
    "robot_quotes_victory": "Blades are a gentleman's weapon, after all.",
    "robot_quotes_defeat": "Ack! Foiled again!",
    "robot_quotes_custom": [],
    "robot_flag_hidden": 0,
    "robot_flag_complete": 1,
    "robot_flag_unlockable": 0,
    "robot_flag_fightable": 1,
    "robot_flag_exclusive": 0,
    "robot_flag_published": 1
}
