{
    "robot_token": "grenade-man",
    "robot_number": "DWN-063",
    "robot_name": "Grenade Man",
    "robot_game": "MM8",
    "robot_field": "",
    "robot_field2": "",
    "robot_support": "",
    "robot_class": "master",
    "robot_gender": "male",
    "robot_image": "grenade-man",
    "robot_image_size": 80,
    "robot_image_editor": "milansaponja",
    "robot_image_editor2": "rockmanfc",
    "robot_image_alts": [],
    "robot_core": "explode",
    "robot_core2": "",
    "robot_description": "Mad Bomber Robot",
    "robot_description2": "Most Robot Masters are created before their special weapons are, as it tends to be easier to make a laser or a flamethrower than a sentient robot. An exception to this is Grenade Man, whose Flash Bombs were the first thing Dr. Wily developed. Wily invented the Flash Bomb while tinkering with some of his past robot masters, creating a new explosive with a much larger blast radius and a longer lasting detonation. However, this came at the price of greatly shortening the fuse of the bombs, meaning even his quickest Robot Masters who fired the Flash Bomb couldn’t outrun the resulting explosion. Wily decided he would need to create an all new Robot Master with two special traits to wield this weapon, the first being an explosion resistant suit of armor, and the second being a reckless personality bordering on masochism. This meant not only would Grenade Man be capable of tanking his own explosions, but he wants to too! The Flash Bomb is not the only weapon Grenade Man wields, however. The Crazy Destroyer is a fury of highly terrain damaging mines Grenade Man spreads across the arena, leaving only rubble in their wake. You’d think these two types of explosives would make Grenade Man a highly strategic fighter, commanding control of the battlefield. You would be wrong; Grenade Man doesn’t have a strategic circuit in his body, only acting on instinct and impulse. He’s more likely to crash himself into his opponents than he is to lay a trap. Heck, Mega Man wouldn’t have discovered Grenade Man’s takeover of an Argentinian artillery factory so quickly if the mad Robot Master wasn’t making such a ruckus over testing their weapons on himself. Wily’s robots have a history of displaying manic personalities, but Grenade Man might be the first one to be certifiably insane. Until someone makes Psychiatry Man to give a proper diagnosis, Grenade Man will just have to treat himself the only way he knows how: dynamite massages and napalm spas.",
    "robot_energy": 87,
    "robot_weapons": 10,
    "robot_attack": 130,
    "robot_defense": 73,
    "robot_speed": 110,
    "robot_weaknesses": [
        "electric",
        "crystal"
    ],
    "robot_resistances": [],
    "robot_affinities": [
        "explode"
    ],
    "robot_immunities": [],
    "robot_skill": "",
    "robot_skill_name": "",
    "robot_skill_description": "",
    "robot_skill_description2": "",
    "robot_skill_parameters": [],
    "robot_abilities_rewards": [
        {
            "level": 0,
            "token": "flash-bomb"
        }
    ],
    "robot_abilities_compatible": [
        "flash-bomb"
    ],
    "robot_quotes_start": "Say hello to my cute little bombs!",
    "robot_quotes_taunt": "Ha ha ha! Hit me harder! HARDER!",
    "robot_quotes_victory": "That must really hurt... Ghaha, I'm so jealous!",
    "robot_quotes_defeat": "THAT FELT GOOD!",
    "robot_quotes_custom": [],
    "robot_flag_hidden": 0,
    "robot_flag_complete": 1,
    "robot_flag_unlockable": 0,
    "robot_flag_exclusive": 0,
    "robot_flag_published": 1
}
