{
    "robot_token": "aqua-man",
    "robot_number": "DWN-064",
    "robot_name": "Aqua Man",
    "robot_game": "MM8",
    "robot_field": "",
    "robot_field2": "waterfall-institute",
    "robot_support": "snapper",
    "robot_class": "master",
    "robot_gender": "male",
    "robot_image": "aqua-man",
    "robot_image_size": 80,
    "robot_image_editor": "milansaponja",
    "robot_image_editor2": "",
    "robot_image_alts": [
        {
            "token": "alt",
            "name": "Aqua Man (Tepid Alt)",
            "summons": 100,
            "colour": "swift"
        },
        {
            "token": "alt2",
            "name": "Aqua Man (Toxic Alt)",
            "summons": 200,
            "colour": "energy"
        },
        {
            "token": "alt3",
            "name": "Aqua Man (Weapon Alt)",
            "summons": 300,
            "colour": "time"
        },
        {
            "token": "alt9",
            "name": "Aqua Man (Darkness Alt)",
            "summons": 900,
            "colour": "empty"
        }
    ],
    "robot_core": "water",
    "robot_core2": "",
    "robot_description": "Water Spraying Robot",
    "robot_description2": "Aquatic robots tend to be the archetype Dr. Wily defaults to when he needs a final robot master to round out a set of new creations. Wily always tries to find some aspect that can make his robots unique though, so when looking at his past marine Robot Masters, he realized they were all designed to work while fully submerged. This inspired Wily to steal a waterworks robot and create Aqua Man, a Robot Master that brings the water with him, able to unleash aquatic onslaughts even in the most arid of battlefields. Aqua Man isn’t conservative with his limited supplies of water either, creating giant geysers and firing the Water Balloon, a frankly wasteful flurry of watery projectiles. However, his most impressive technique might be the Water Cannon, a column of water Aqua Man can redirect during while the attack is still being fired. How on earth is this possible, you might be asking; perhaps the water is chilled to the point of nearly being solid, so Aqua Man is controlling nearly solid slush rather than water? That would make sense considering Dr. Wily used leftover parts from Frost Man in his modifications of Aqua Man. Then again, Frost Man himself was made with leftover parts from Clown Man, so did any of those find their way into Aqua Man? Maybe the joke telling circuit did, but it must have gotten fried at some point, cause Aqua Man’s crass humor makes even Cut Man groan. Aqua Man makes for awful company in general, his childlike temperament and toilet jokes driving most robots mad. Imagine how excited poor Wave Man’s must have been to discover Wily had created a robot that used to work in water treatment, only to be met with a robot making fart noises and leaving his lunch scraps everywhere. It was then Aqua Man’s weakness to blunt force attacks was discovered. You might be able to crack his tanks with a hard-enough blow, meaning he’ll lose all stored water he attacks with, but more importantly, you might get him to take a hint and shut up.",
    "robot_energy": 108,
    "robot_weapons": 10,
    "robot_attack": 85,
    "robot_defense": 117,
    "robot_speed": 90,
    "robot_weaknesses": [
        "impact",
        "shadow"
    ],
    "robot_resistances": [
        "cutter"
    ],
    "robot_affinities": [],
    "robot_immunities": [
        "water"
    ],
    "robot_skill": "",
    "robot_skill_name": "",
    "robot_skill_description": "",
    "robot_skill_description2": "",
    "robot_skill_parameters": [],
    "robot_abilities_rewards": [
        {
            "level": 0,
            "token": "water-balloon"
        }
    ],
    "robot_abilities_compatible": [
        "water-balloon"
    ],
    "robot_quotes_start": "I'm {this_robot}, but you can feel free to call me Handsome Guy!",
    "robot_quotes_taunt": "PFFFT... Hee hee, {target_robot}, was that you just now?",
    "robot_quotes_victory": "You know, {this_player}, if we're done here... I say we call it lunchtime!",
    "robot_quotes_defeat": "Aye aye aye! This is all way too serious for me!",
    "robot_quotes_custom": [],
    "robot_flag_hidden": 0,
    "robot_flag_complete": 1,
    "robot_flag_unlockable": 1,
    "robot_flag_exclusive": 0,
    "robot_flag_published": 1
}
