{
    "robot_token": "stone-man",
    "robot_number": "DWN-035",
    "robot_name": "Stone Man",
    "robot_game": "MM5",
    "robot_field": "",
    "robot_field2": "",
    "robot_support": "",
    "robot_class": "master",
    "robot_gender": "male",
    "robot_image": "stone-man",
    "robot_image_size": 80,
    "robot_image_editor": "elitep1",
    "robot_image_editor2": "",
    "robot_image_alts": [
        {
            "token": "alt",
            "name": "Stone Man (Mossy Alt)",
            "summons": 100,
            "colour": "nature"
        },
        {
            "token": "alt2",
            "name": "Stone Man (Frozen Alt)",
            "summons": 200,
            "colour": "freeze"
        },
        {
            "token": "alt3",
            "name": "Stone Man (Weapon Alt)",
            "summons": 300,
            "colour": "earth"
        },
        {
            "token": "alt9",
            "name": "Stone Man (Alt9)",
            "summons": 900,
            "colour": "empty"
        }
    ],
    "robot_core": "earth",
    "robot_core2": "",
    "robot_description": "Disassembling Brick Robot",
    "robot_description2": "Dr. Wily has created Robot Masters faster than the speed of sound, capable of stopping time, and hotter than the surface of the sun, and for his most diabolical scheme yet, Wily will finally destroy Mega Man once and for all… by hitting him with a rock. Well, a lot of rocks to be precise. Stone Man is as imposing as he looks, destroying enemy robots with all the resilience of a brick wall. Using the Power Stone, Stone Man orbits large rocks around the battlefield, limiting his opponent’s movement, leaving them open for strong physical blows. Stone Man’s bricks are near impossible to scratch, let alone destroy, making them individually incredibly durable. Trying to hold them all together, however, is another story. This might seem like a weakness, but Stone Man uses this trait to his advantage, rolling with his opponent’s punches by crumbling and reforming to brace attacks. Stone Man has grown quite accustomed to throwing his weight around, knowing he can get up again if he gets knocked down. It’s this persistence that led Stone Man to form a strong friendship with Guts Man, having finally found someone he can pal around with without one of them accidentally destroying the other. Unfortunately, Guts Man does not share the enthusiasm Stone Man has for film, but they still find their common ground, hanging out in oil bars. Until they get kicked out for roughhousing, anyways.",
    "robot_energy": 103,
    "robot_weapons": 10,
    "robot_attack": 110,
    "robot_defense": 127,
    "robot_speed": 60,
    "robot_weaknesses": [
        "explode",
        "freeze"
    ],
    "robot_resistances": [
        "swift",
        "electric"
    ],
    "robot_affinities": [],
    "robot_immunities": [],
    "robot_skill": "",
    "robot_skill_name": "",
    "robot_skill_description": "",
    "robot_skill_description2": "",
    "robot_skill_parameters": [],
    "robot_abilities_rewards": [
        {
            "level": 0,
            "token": "power-stone"
        }
    ],
    "robot_abilities_compatible": [
        "power-stone"
    ],
    "robot_quotes_start": "Bring it! Once I get started, I can weather any attack you throw!",
    "robot_quotes_taunt": "Man, this reminds me of this part in a movie where....",
    "robot_quotes_victory": "Course I won, there ain't a force out there that'll crack real rock-hard persistence!",
    "robot_quotes_defeat": "Uhhh, usually I'm supposed to form back together... Uh oh.",
    "robot_quotes_custom": [],
    "robot_flag_hidden": 0,
    "robot_flag_complete": 1,
    "robot_flag_unlockable": 0,
    "robot_flag_fightable": 1,
    "robot_flag_exclusive": 0,
    "robot_flag_published": 1
}
