{
    "robot_token": "pirate-man",
    "robot_number": "KGN-004",
    "robot_name": "Pirate Man",
    "robot_game": "RnF",
    "robot_field": "",
    "robot_field2": "submerged-armory",
    "robot_support": "snapper",
    "robot_class": "master",
    "robot_gender": "male",
    "robot_image": "pirate-man",
    "robot_image_size": 80,
    "robot_image_editor": "milansaponja",
    "robot_image_editor2": "rhythmbca",
    "robot_image_editor3": "",
    "robot_image_alts": [
        {
            "token": "alt",
            "name": "Pirate Man (Commodore Alt)",
            "summons": 100,
            "colour": "water"
        },
        {
            "token": "alt2",
            "name": "Pirate Man (Buccaneer Alt)",
            "summons": 200,
            "colour": "swift"
        },
        {
            "token": "alt3",
            "name": "Pirate Man (Weapon Alt)",
            "summons": 300,
            "colour": "crystal"
        },
        {
            "token": "alt9",
            "name": "Pirate Man (Darkness Alt)",
            "summons": 900,
            "colour": "empty"
        }
    ],
    "robot_core": "explode",
    "robot_core2": "",
    "robot_description": "Scurvy Sea-Dog Robot",
    "robot_description2": "Ground Man was created to acquire King a treasure hoard, and he did so with aplomb, barring one small exception that you can probably guess: Ground Man can’t swim. To fund his rebellion to the fullest, King would need a robot that could scour the sea for treasure as easily as Ground Man did on land. And what would be a more fitting moniker than Pirate Man, modeled after an old-timey privateer? Decked out with a tricorne, an eyepatch, and a hooked hand, Pirate Man is just shy of a peg leg to be the perfect buccaneer stereotype! That hook hand isn’t the only weapon at his disposal though. Pirate Man is a master of the two elements you’d think a pirate ought to be: water and explosives! Pirate Man can drain and fill his environment as he needs, and when he’s got enough water to go buoyant, he’ll encase himself in a bubble and rush down his enemies. It might not sound strategic, but that’s just true to history. Pirates ruled by brute force, not strategy! However, if a more tactical weapon is warranted, Pirate Man isn’t afraid to throw out the Remote Mine, an explosive with a seemingly endless fuse, able to lie in wait until remotely detonated by the user. Why would you need a bomb with that much delay? Maybe Pirate Man secretly planted them on ships he intended to raid and waited for them to enter international waters before striking. Pirate Man probably needed to be this devious to get a fraction of the wealth Ground Man did, as Dive Man was constantly on his tracks, trying to put a stop to his thievery. You almost feel bad for Pirate Man, cause it seems like Dive Man was specifically made to stop the kind of shenanigans Pirate Man was made for, and Dive Man was made first! It's no wonder he seems so stressed, being found downing drinks at the oil bar whenever he isn't at sea. He tried for a while to leave the oil out before drinking it, hoping to make its effects more potent, but he eventually discovered oil fermentation doesn't work like that.",
    "robot_energy": 99,
    "robot_weapons": 10,
    "robot_attack": 113,
    "robot_defense": 104,
    "robot_speed": 84,
    "robot_weaknesses": [
        "flame",
        "missile"
    ],
    "robot_resistances": [
        "earth"
    ],
    "robot_affinities": [],
    "robot_immunities": [
        "water"
    ],
    "robot_skill": "water-subcore",
    "robot_skill_name": "Seafaring",
    "robot_skill_description": "",
    "robot_skill_description2": "",
    "robot_skill_parameters": [],
    "robot_abilities_rewards": [
        {
            "level": 0,
            "token": "remote-mine"
        }
    ],
    "robot_abilities_compatible": [
        "remote-mine"
    ],
    "robot_quotes_start": "Avast, me hearties! Prepare for battle!",
    "robot_quotes_taunt": "Don't try to beg for mercy, scallywag!",
    "robot_quotes_victory": "Yo ho, yo ho, a pirate's life for me...",
    "robot_quotes_defeat": "Shiver me timbers! Parley! Parley!",
    "robot_quotes_custom": [],
    "robot_flag_hidden": 0,
    "robot_flag_complete": 1,
    "robot_flag_unlockable": 1,
    "robot_flag_fightable": 1,
    "robot_flag_exclusive": 0,
    "robot_flag_published": 1
}
