{
    "robot_token": "astro-man",
    "robot_number": "DWN-058",
    "robot_name": "Astro Man",
    "robot_game": "MM8",
    "robot_field": "",
    "robot_field2": "space-simulator",
    "robot_support": "ring-ring",
    "robot_class": "master",
    "robot_gender": "male",
    "robot_image": "astro-man",
    "robot_image_size": 80,
    "robot_image_editor": "milansaponja",
    "robot_image_editor2": "rockmanfc",
    "robot_image_alts": [
        {
            "token": "alt",
            "name": "Astro Man (Bubblegum Alt)",
            "summons": 100,
            "colour": "crystal"
        },
        {
            "token": "alt2",
            "name": "Astro Man (Golden Alt)",
            "summons": 200,
            "colour": "electric"
        },
        {
            "token": "alt9",
            "name": "Astro Man (Darkness Alt)",
            "summons": 900,
            "colour": "empty"
        }
    ],
    "robot_core": "space",
    "robot_core2": "",
    "robot_description": "Holographic Illusions Robot",
    "robot_description2": "After Duo’s battle in the exosphere scattered evil energy across the Earth’s surface, Dr. Wily was eager to collect and experiment with the mysterious substance. However, initial analysis showed the evil energy was highly unstable, so rather than just jamming it into a past robot master and risk corrupting one of his prized creations, Wily decided he would insert it into a commercial robot he had previously stolen and repurposed for combat. But how did Wily prevent this first test subject from going on an uncontrollable rampage with its new found alien power? By giving it a cowardly disposition, of course! And thus Astro Man was born, the first evil energy test subject, and a middling success. Astro Man is a gentle giant, his destructive evil energy enhanced firepower locked behind a meek coward with a distaste for direct confrontations and cheap jokes. If he absolutely has to fight, he prefers to do so with powerful attacks that keep his opponents away, like the physically taxing Astro Crush, a volley of meteors that rain down on the battlefield. If you look closely at those meteors, which you should have plenty of time to do as they come hurtling towards you, you may see that they are in the shape of Astro Man himself. Could it be that Astro Man’s weak demeanor is only a facade to hide a dangerous ego? Probably not, considering Astro Man’s history of conceding in fights he clearly would have won. Maybe the Astro Crush is a physically represented form of self hatred, as Astro Man smashes images of his likeness into pieces? This also seems unlikely, as Astro Man would never work up the nerve to so violently confront somebody, even himself. If Astro Man hadn’t been handicapped with his timid personality, it's possible Dr. Wily would have finally triumphed over his blue nemesis. The tin man is supposed to want a heart, but Astro Man’s got too much emotion! Maybe he can talk to Slash Man about getting some courage.",
    "robot_energy": 104,
    "robot_weapons": 10,
    "robot_attack": 84,
    "robot_defense": 108,
    "robot_speed": 104,
    "robot_weaknesses": [
        "missile",
        "shadow"
    ],
    "robot_resistances": [
        "space",
        "wind"
    ],
    "robot_affinities": [],
    "robot_immunities": [],
    "robot_skill": "xtreme-submodule",
    "robot_skill_name": "Oversensitive",
    "robot_skill_description": "",
    "robot_skill_description2": "",
    "robot_skill_parameters": [],
    "robot_abilities_rewards": [
        {
            "level": 0,
            "token": "astro-crush"
        }
    ],
    "robot_abilities_compatible": [
        "astro-crush"
    ],
    "robot_quotes_start": "Oh man, how did you find me?!",
    "robot_quotes_taunt": "Can we at least settle this fairly? No?",
    "robot_quotes_victory": "Wow, I'm actually really strong... so now I can stay in my safe space forever! Yay!",
    "robot_quotes_defeat": "Aah, I can't take this anymore! It's too embarrassing...",
    "robot_quotes_custom": [],
    "robot_flag_hidden": 0,
    "robot_flag_complete": 1,
    "robot_flag_unlockable": 1,
    "robot_flag_fightable": 1,
    "robot_flag_exclusive": 0,
    "robot_flag_published": 1
}
