{
    "robot_token": "dynamo-man",
    "robot_number": "KGN-001",
    "robot_name": "Dynamo Man",
    "robot_game": "RnF",
    "robot_field": "",
    "robot_field2": "power-plant",
    "robot_support": "bulb-blaster",
    "robot_class": "master",
    "robot_gender": "male",
    "robot_image": "dynamo-man",
    "robot_image_size": 80,
    "robot_image_editor": "milansaponja",
    "robot_image_editor2": "",
    "robot_image_alts": [
        {
            "token": "alt",
            "name": "Dynamo Man (Electric-B Alt)",
            "summons": 100,
            "colour": "defense"
        },
        {
            "token": "alt2",
            "name": "Dynamo Man (Purple-L Alt)",
            "summons": 200,
            "colour": "speed"
        },
        {
            "token": "alt3",
            "name": "Dynamo Man (Weapon Alt)",
            "summons": 300,
            "colour": "cutter"
        },
        {
            "token": "alt9",
            "name": "Dynamo Man (Darkness Alt)",
            "summons": 900,
            "colour": "empty"
        }
    ],
    "robot_core": "electric",
    "robot_core2": "",
    "robot_description": "Power-Plant Supervisor Robot",
    "robot_description2": "Robots have turned villainous for many reasons in 20XX. Some were created for the express purpose of causing destruction, while others were coerced into antagonism, be it by reprogramming, blackmail, or viral infections. But what about the robots that willingly chose to betray their creators? Do they revel in their villany, or do they have regrets? Dynamo Man, who was formerly a mild mannered tour guide robot, had approached King after hearing rumors about sermons of “robot independence,” wanting to learn how to better assert himself. He had so much to share with the museum patrons, but his speeches often fell on the deft ears of disinterested guests. Instead, Dynamo was radicalized and weaponized by the silver-tongued King, and sent back to the power plant on reconnaissance, gaining information on the nearby city’s power consumption. The personality matrix of Dynamo Man was not designed to work in his newly generated electromagnetic fields, and Dynamo Man consequently became unstable. The visitors who formerly treated Dynamo Man with apathy became fearful and distant. Dynamo Man was enraged at this ostracization, growing a distaste for humanity and fully enlisting in King’s militia, becoming a devastating foe when fought under the right conditions. Dynamo Man’s power output is unmatched by any other robot master, demonstrated in his wicked Dynamo Bolt, strikes of lightning capable of shocking even the most insulated targets. However, the Dynamo Bolt is the only attack Dynamo can use on his own, and it is very taxing on his internal storage. What really makes Dynamo Man a deadly combatant is his gadgetry. In his quarters, Dynamo Man can volley small dynamos that continuously discharge electricity at his foes or can hop into a recharge station to rapidly fill his batteries. You’d think this equipment would have been left in the real world, but it seems they were somehow digitized alongside Dynamo Man. He’s certainly a tough robot master to take down, and that’s assuming he stays down; how many more times is he going to get back up? Dynamo Man is a robot that could more easily be pacified with compassion instead of violence, but the Prototype will allow no such peaceful fate.",
    "robot_energy": 106,
    "robot_weapons": 10,
    "robot_attack": 107,
    "robot_defense": 87,
    "robot_speed": 100,
    "robot_weaknesses": [
        "space",
        "shadow"
    ],
    "robot_resistances": [
        "wind"
    ],
    "robot_affinities": [
        "electric"
    ],
    "robot_immunities": [],
    "robot_skill": "",
    "robot_skill_name": "",
    "robot_skill_description": "",
    "robot_skill_description2": "",
    "robot_skill_parameters": [],
    "robot_abilities_rewards": [
        {
            "level": 0,
            "token": "dynamo-bolt"
        }
    ],
    "robot_abilities_compatible": [],
    "robot_quotes_start": "All I'll do is hurt you... so don't get any closer!",
    "robot_quotes_taunt": "Go, go, shoo! It's really not safe to be around me!",
    "robot_quotes_victory": "You should've just ran away! Like... everyone else...",
    "robot_quotes_defeat": "Is it time to recharge already?",
    "robot_quotes_custom": [],
    "robot_flag_hidden": 0,
    "robot_flag_complete": 1,
    "robot_flag_unlockable": 1,
    "robot_flag_fightable": 1,
    "robot_flag_exclusive": 0,
    "robot_flag_published": 1
}
