{
    "robot_token": "sword-man",
    "robot_number": "DWN-059",
    "robot_name": "Sword Man",
    "robot_game": "MM8",
    "robot_field": "",
    "robot_field2": "",
    "robot_support": "",
    "robot_class": "master",
    "robot_gender": "male",
    "robot_image": "sword-man",
    "robot_image_size": 80,
    "robot_image_editor": "milansaponja",
    "robot_image_editor2": "rockmanfc",
    "robot_image_alts": [],
    "robot_core": "flame",
    "robot_core2": "",
    "robot_description": "Noble Swordsman Robot",
    "robot_description2": "Dr. Wily is as stubborn as he is brilliant. After stealing a sword with primitive flame emitting technology from the Museum of Robotic Artifacts, Wily realized he had seriously underestimated the weight of the weapon. The robot Wily intended to arm the sword with was much too small to bear the weight of the relic. Two possibilities arose for how to fix this: one, to remake the robot to be bulkier, and two, to simply make his own sword rather than use an outdated curio. Wily decided to do the logical thing and supplement the sword’s weight by implementing an anti-gravitational device separating the robot’s upper and lower halves. Thus, Sword Man’s turbulent development was finally completed and the combat robot master was stationed in Central Asia, guarding the entrance to the subterranean Wily Tower. Despite how ludicrous the anti-gravity device might seem, it ended up working off in spades for Sword Man, who has combined raw strength, agility, and precision in his laigiri inspired fighting style. The Flame Sword is a terrifyingly strong blade in its own right, but its ability to emit flames while being swung makes this blade a weapon with a deceptively long range; if you’re not directly hit by the sword, you’ll still be ignited by the fire it leaves in its wake! Distance fighting won’t work either, as the anti-gravitational device allows Sword Man to easily close the gap, either sending his upper torso forward in a spiraling slash, or launching himself upwards and severing opponents with a descending sword strike. Sword Man knows just how strong he is, but that doesn’t mean he is egotistical about it. The most surprising thing about an already unusual Wily Robot Master might be just how stoic Sword Man is. Sword Man would rather lose a fair fight than cheat a victory, and will even openly commend his opponent’s abilities in combat. This means fighting Sword Man can feel more like a friendly spar than a confrontation of good and evil. However, it’s important you don’t equate this courtesy with him holding back. Sword Man’s fighting with everything he’s got! Whether it’s in the Prototype or in an abandoned volcanic temple, there are two things Sword Man wants you to know. One, he won’t be holding back, so don’t take it personally. Two, don’t bring a chipped blade to your duel. That’d just be disrespectful.",
    "robot_energy": 100,
    "robot_weapons": 10,
    "robot_attack": 129,
    "robot_defense": 80,
    "robot_speed": 91,
    "robot_weaknesses": [
        "water",
        "earth"
    ],
    "robot_resistances": [],
    "robot_affinities": [],
    "robot_immunities": [
        "flame"
    ],
    "robot_skill": "cutter-subcore",
    "robot_skill_name": "Noble Sword",
    "robot_skill_description": "",
    "robot_skill_description2": "",
    "robot_skill_parameters": [],
    "robot_abilities_rewards": [
        {
            "level": 0,
            "token": "flame-sword"
        }
    ],
    "robot_abilities_compatible": [
        "flame-sword"
    ],
    "robot_quotes_start": "Let us make this a fair fight, shall we?",
    "robot_quotes_taunt": "It's nothing personal, but I have my orders.",
    "robot_quotes_victory": "I'm afraid there is no second chance for you.",
    "robot_quotes_defeat": "It would seem you are the better robot...",
    "robot_quotes_custom": [],
    "robot_flag_hidden": 0,
    "robot_flag_complete": 1,
    "robot_flag_unlockable": 0,
    "robot_flag_exclusive": 0,
    "robot_flag_published": 1
}
